app/Controllers/AjexController.php

SELECT *
FROM `student`
ORDER BY `guid` DESC
---
    public function getdata()
    {
         $student = new StudentModel();
         $data['students']= $student->orderBy('guid','DESC')->findAll();