app/Controllers/Login.php

    public function loginAuth()
    {
        $session = session();
        $userModel = new LoginModel();
        $eamil = $this->request->getVar('eamil');
        $Password = $this->request->getVar('Password');
        //print_r( $Password);
        $data = $userModel->where('eamil', $eamil)->first();
---
SELECT *
FROM `users`
WHERE `eamil` = 'bhaskarsuggu41@gmail.com'
 LIMIT 1