app/Controllers/ProductController.php

SELECT *
FROM `product`
---
    public function index()
    {
        $sess_data = $session = session();
        if($sess_data->get('guid') == '' ){redirect('Login');}
       $product = new ProductModel();
       $data['products']= $product->findAll();